spbuild.dot
digraph spbuild {
  extlibpatch [label="Patch external libraries"];
  pinnedcompiler [label="A fixed compiler/toolchain"];
  perlbuild [label="Build our Perl"];
  extlibbuild [label="Build external libraries (some need Perl)"];
  perlmodinstall [label="Install modules into built Perl"];
  perlpackage [label="Package built Perl"];
  perlrelease [label="Release package on web"];

  extlibpatch -> extlibbuild;
  pinnedcompiler -> extlibbuild;
  pinnedcompiler -> perlbuild;
  perlbuild -> extlibbuild;
  extlibbuild -> perlmodinstall;
  perlbuild -> perlmodinstall;
  perlmodinstall -> perlpackage;
  perlpackage -> perlrelease;
}
